import time  # 引入时间模块
import random  # 引入随机数模块
print("==========================================")
print("==========================================")
print("=====本软件仅限于学习，请勿用于违法！=====")
print("=========且作者不负任何法律责任===========")
print("=============by.保洁PowerJ================")
print("==========================================")
print("==========================================")
print(" ")
print("本攻击器威力巨大，请慎重使用！")
a = str(input("请输入要攻击的ip:"))
b = int(input("请输入要攻击的端口:"))
print("正在连接发包攻击器，请稍后...")
time.sleep(2)
x = random.randint(14,22)  # 随机生成14到22之间的随机数
print("连接成功，当前有",x,"台攻击器在线。")
n = int(input("请输入攻击次数:"))
print("即将开始对目标进行攻击！")
time.sleep(1.5)
for i in range(1,n+1):
    time.sleep(0.8)
    print("已发送",i,"个数据包到",a,"端口",b)
print("对目标攻击已完成！")
end = input("按任意键继续。")
    